## New York City Taxi Trip Prediction

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('taxifare.csv')

In [3]:
df.head()

           pickup_datetime  fare_amount  ...  dropoff_latitude  passenger_count
0  2010-04-19 08:17:56 UTC          6.5  ...         40.744746                1
1  2010-04-17 15:43:53 UTC          6.9  ...         40.744114                1
2  2010-04-17 11:23:26 UTC         10.1  ...         40.766235                2
3  2010-04-11 21:25:03 UTC          8.9  ...         40.748192                1
4  2010-04-17 02:19:01 UTC         19.7  ...         40.743115                1

[5 rows x 8 columns]

In [4]:
df.shape

(120000, 8)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120000 entries, 0 to 119999
Data columns (total 8 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   pickup_datetime    120000 non-null  object
 1   fare_amount        120000 non-null  float64
 2   fare_class         120000 non-null  int64
 3   pickup_longitude   120000 non-null  float64
 4   pickup_latitude    120000 non-null  float64
 5   dropoff_longitude  120000 non-null  float64
 6   dropoff_latitude   120000 non-null  float64
 7   passenger_count    120000 non-null  int64
dtypes: float64(5), int64(2), object(1)
memory usage: 7.3+ MB

In [6]:
len(df['fare_class'].unique())

2

In [7]:
len(df['passenger_count'].unique())

5

### Feature Engineering with respect to Datetime

In [8]:
import datetime

In [9]:
pd.to_datetime(df['pickup_datetime'])

0        2010-04-19 08:17:56+00:00
1        2010-04-17 15:43:53+00:00
2        2010-04-17 11:23:26+00:00
3        2010-04-11 21:25:03+00:00
4        2010-04-17 02:19:01+00:00
                    ...
119995   2010-04-18 14:33:03+00:00
119996   2010-04-23 10:27:48+00:00
119997   2010-04-18 18:50:40+00:00
119998   2010-04-13 08:14:44+00:00
119999   2010-04-17 16:00:14+00:00
Name: pickup_datetime, Length: 120000, dtype: datetime64[ns, UTC]

In [10]:
df['pickup_datetime']=pd.to_datetime(df['pickup_datetime'])-datetime.timedelta(hours=4)

In [12]:
df['pickup_datetime']

0        2010-04-19 04:17:56+00:00
1        2010-04-17 11:43:53+00:00
2        2010-04-17 07:23:26+00:00
3        2010-04-11 17:25:03+00:00
4        2010-04-16 22:19:01+00:00
                    ...
119995   2010-04-18 10:33:03+00:00
119996   2010-04-23 06:27:48+00:00
119997   2010-04-18 14:50:40+00:00
119998   2010-04-13 04:14:44+00:00
119999   2010-04-17 12:00:14+00:00
Name: pickup_datetime, Length: 120000, dtype: datetime64[ns, UTC]

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120000 entries, 0 to 119999
Data columns (total 8 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   pickup_datetime    120000 non-null  datetime64[ns, UTC]
 1   fare_amount        120000 non-null  float64
 2   fare_class         120000 non-null  int64
 3   pickup_longitude   120000 non-null  float64
 4   pickup_latitude    120000 non-null  float64
 5   dropoff_longitude  120000 non-null  float64
 6   dropoff_latitude   120000 non-null  float64
 7   passenger_count    120000 non-null  int64
dtypes: datetime64[ns, UTC](1), float64(5), int64(2)
memory usage: 7.3 MB

In [13]:
df.head()

            pickup_datetime  fare_amount  ...  dropoff_latitude  passenger_count
0 2010-04-19 04:17:56+00:00          6.5  ...         40.744746                1
1 2010-04-17 11:43:53+00:00          6.9  ...         40.744114                1
2 2010-04-17 07:23:26+00:00         10.1  ...         40.766235                2
3 2010-04-11 17:25:03+00:00          8.9  ...         40.748192                1
4 2010-04-16 22:19:01+00:00         19.7  ...         40.743115                1

[5 rows x 8 columns]

In [14]:
df['pickup_datetime'].dt.month

0         4
1         4
2         4
3         4
4         4
         ..
119995    4
119996    4
119997    4
119998    4
119999    4
Name: pickup_datetime, Length: 120000, dtype: int64

In [16]:
len((df['pickup_datetime'].dt.month).unique())

1

In [17]:
df['Year']=df['pickup_datetime'].dt.year
df['Month']=df['pickup_datetime'].dt.month
df['Day']=df['pickup_datetime'].dt.day
df['Hours']=df['pickup_datetime'].dt.hour
df['Minutes']=df['pickup_datetime'].dt.minute

In [18]:
df.head()

            pickup_datetime  fare_amount  fare_class  ...  Day  Hours  Minutes
0 2010-04-19 04:17:56+00:00          6.5           0  ...   19      4       17
1 2010-04-17 11:43:53+00:00          6.9           0  ...   17     11       43
2 2010-04-17 07:23:26+00:00         10.1           1  ...   17      7       23
3 2010-04-11 17:25:03+00:00          8.9           0  ...   11     17       25
4 2010-04-16 22:19:01+00:00         19.7           1  ...   16     22       19

[5 rows x 13 columns]

In [19]:
import numpy as np

In [20]:
df['mornight']=np.where(df['Hours']<12,0,1)

In [21]:
df.head()

            pickup_datetime  fare_amount  fare_class  ...  Hours  Minutes  mornight
0 2010-04-19 04:17:56+00:00          6.5           0  ...      4       17         0
1 2010-04-17 11:43:53+00:00          6.9           0  ...     11       43         0
2 2010-04-17 07:23:26+00:00         10.1           1  ...      7       23         0
3 2010-04-11 17:25:03+00:00          8.9           0  ...     17       25         1
4 2010-04-16 22:19:01+00:00         19.7           1  ...     22       19         1

[5 rows x 14 columns]

In [22]:
df.drop('pickup_datetime',axis=1,inplace=True)

In [23]:
df.head()

   fare_amount  fare_class  pickup_longitude  ...  Hours  Minutes  mornight
0          6.5           0        -73.992365  ...      4       17         0
1          6.9           0        -73.990078  ...     11       43         0
2         10.1           1        -73.994149  ...      7       23         0
3          8.9           0        -73.990485  ...     17       25         1
4         19.7           1        -73.990976  ...     22       19         1

[5 rows x 13 columns]

In [24]:
df['fare_class'].unique()

array([0, 1])

In [25]:
# https://scikit-learn.org/stable/modules/generated/sklearn.metrics.pairwise.haversine_distances.html#:~:text=The%20Haversine%20(or%20great%20circle,the%20data%20must%20be%202

from sklearn.metrics.pairwise import haversine_distances
from math import radians
newdelhi = [28.6139, 77.2090]
bangalore = [12.9716, 77.5946]

In [26]:
newdelhi_in_radians = [radians(_) for _ in newdelhi]
bangalore_in_radians = [radians(_) for _ in bangalore]

In [27]:
result = haversine_distances([newdelhi_in_radians, bangalore_in_radians])

* Multiplying with 6371 to get the answer in kilometers instead of radius.

In [28]:
result*6371

array([[   0.       , 1739.8021019],
       [1739.8021019,    0.       ]])